nxp-mcuxpresso/mcuxsdk-examples/_boards/lpcxpresso860max/demo_apps/mc_pmsm/pmsm_snsless/pin_mux.c
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v14.0
processor: LPC865
package_id: LPC865M201JBD64
mcu_data: ksdk2_0
processor_version: 0.14.4
board: LPCXpresso860MAX
pin_labels:
- {pin_num: '16', pin_signal: PIO0_11, label: 'P0_11-I2C0_SDA/P3[40]/J1[18]/J3[7]', identifier: OVERCURRENT}
- {pin_num: '18', pin_signal: PIO1_1, label: 'P1_1-PWM_CB/J5[5]', identifier: PWM_CB}
- {pin_num: '19', pin_signal: PIO0_16, label: 'P0_16-PWM_CT/J5[7]', identifier: PWM_CT}
- {pin_num: '20', pin_signal: PIO1_2, label: 'P1_2-PWM_BB/J5[9]', identifier: PWM_BB}
- {pin_num: '21', pin_signal: PIO0_27, label: 'P0_27-PWM_BT/J5[11]', identifier: PWM_BT}
- {pin_num: '35', pin_signal: PIO1_5, label: 'J5[13]/P1_5-PWM_AB', identifier: PWM_AB}
- {pin_num: '38', pin_signal: PIO1_6, label: 'J5[15]/P1_6-PWM_AT', identifier: PWM_AT}
- {pin_num: '45', pin_signal: PIO0_7/ADC_0, label: 'J6[12]/P3[20]/PIO0_7/ADC_0', identifier: TEST_PIN}
- {pin_num: '49', pin_signal: PIO0_14/ACMP_I3/ADC_2, label: 'P3[18]/J6[8]/PIO0_14-ADC_2-ACMP_I3', identifier: TP_POI14_J6;TP_POI14_J6_8;CUR_DCB;CUR_DCB_J6_8}
- {pin_num: '51', pin_signal: PIO0_23/ADC_3/ACMP_I4, label: 'P3[17]/J6[6]/PIO0_23-ADC_3-ACMP_I4', identifier: TP_PIO23_;TP_PIO23_J6_6}
- {pin_num: '57', pin_signal: PIO0_21/ADC_5, label: 'J6[2]/J2[12]/P3[15]/P3[46]/PIO0_21/ADC_5', identifier: TEST_PIN2}
- {pin_num: '58', pin_signal: PIO0_20/ADC_6, label: 'J1[1]/J2[14/P3[45/P0_20-BEMF_A', identifier: CUR_A}
- {pin_num: '60', pin_signal: PIO0_19/ADC_7, label: 'J1[3]/J2[16]/P3[44]/P0_19-BEMF_B', identifier: CUR_B}
- {pin_num: '61', pin_signal: PIO0_18/ADC_8, label: 'J1[5]/J1[6]/P3[43]/P0_18-BEMF_C', identifier: CUR_C}
- {pin_num: '63', pin_signal: PIO0_17/ADC_9, label: 'J1[7]/J1[8]/P3[42]/P0_17-VOLT_DCB', identifier: VOLT_DCB}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_iocon.h"
#include "fsl_swm.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
    BOARD_InitLEDsPins();
    BOARD_InitBUTTONsPins();
    BOARD_InitUSART();
    BOARD_InitFTM0();
    BOARD_InitADC();
    BOARD_InitACOMP();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M0P */
void BOARD_InitPins(void)
{
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLEDsPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '4', peripheral: GPIO, signal: 'PIO0, 12', pin_signal: PIO0_12, identifier: LED_RED, direction: OUTPUT, gpio_init_state: 'true', mode: inactive, invert: disabled,
    hysteresis: enabled, opendrain: enabled, smode: bypass, clkdiv: div0}
  - {pin_num: '9', peripheral: GPIO, signal: 'PIO1, 12', pin_signal: PIO1_12, direction: OUTPUT, gpio_init_state: 'true', mode: inactive, invert: disabled, hysteresis: enabled,
    opendrain: enabled, smode: bypass, clkdiv: div0}
  - {pin_num: '10', peripheral: GPIO, signal: 'PIO0, 28', pin_signal: PIO0_28/WKTCLKIN, direction: OUTPUT, gpio_init_state: 'true', mode: inactive, invert: disabled,
    hysteresis: enabled, opendrain: enabled, smode: bypass, clkdiv: div0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLEDsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M0P */
void BOARD_InitLEDsPins(void)
{
    /* Enables clock for IOCON.: enable */
    CLOCK_EnableClock(kCLOCK_Iocon);
    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);
    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);

    gpio_pin_config_t LED_RED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U,
    };
    /* Initialize GPIO functionality on pin PIO0_12 (pin 4)  */
    GPIO_PinInit(BOARD_INITLEDSPINS_LED_RED_GPIO, BOARD_INITLEDSPINS_LED_RED_PORT, BOARD_INITLEDSPINS_LED_RED_PIN, &LED_RED_config);

    gpio_pin_config_t LED_BLUE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U,
    };
    /* Initialize GPIO functionality on pin PIO0_28 (pin 10)  */
    GPIO_PinInit(BOARD_INITLEDSPINS_LED_BLUE_GPIO, BOARD_INITLEDSPINS_LED_BLUE_PORT, BOARD_INITLEDSPINS_LED_BLUE_PIN, &LED_BLUE_config);

