nxp-mcuxpresso/mcuxsdk-examples/_boards/lpcxpresso860max/demo_apps/mc_pmsm/pmsm_snsless/pin_mux.c
    /* FTM0_CH2 connect to kSWM_FTM_Selection2 */
    SWM_SetFlextimerPinSelect(SWM0, kSWM_FTM0_CH2, kSWM_FTM_Selection2);

    /* FTM0_CH3 connect to kSWM_FTM_Selection2 */
    SWM_SetFlextimerPinSelect(SWM0, kSWM_FTM0_CH3, kSWM_FTM_Selection2);

    /* FTM0_CH4 connect to kSWM_FTM_Selection1 */
    SWM_SetFlextimerPinSelect(SWM0, kSWM_FTM0_CH4, kSWM_FTM_Selection1);

    /* FTM0_CH5 connect to kSWM_FTM_Selection1 */
    SWM_SetFlextimerPinSelect(SWM0, kSWM_FTM0_CH5, kSWM_FTM_Selection1);

    SYSCON->FTMFLTCFG = ((SYSCON->FTMFLTCFG &
                          /* Mask bits to zero which are setting */
                          (~(SYSCON_FTMFLTCFG_FTM0_FAULT0_MUX_SEL_MASK)))

                         /* Mux selection FTM0 fault from external I/O or internal.: Select internal */
                         | SYSCON_FTMFLTCFG_FTM0_FAULT0_MUX_SEL(FTMFLTCFG_FTM0_FAULT0_MUX_SEL_INTERNAL));

    /* Disable clock for switch matrix. */
    CLOCK_DisableClock(kCLOCK_Swm);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitADC:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '58', peripheral: ADC0, signal: 'CH, 6', pin_signal: PIO0_20/ADC_6}
  - {pin_num: '60', peripheral: ADC0, signal: 'CH, 7', pin_signal: PIO0_19/ADC_7}
  - {pin_num: '61', peripheral: ADC0, signal: 'CH, 8', pin_signal: PIO0_18/ADC_8}
  - {pin_num: '63', peripheral: ADC0, signal: 'CH, 9', pin_signal: PIO0_17/ADC_9}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitADC
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M0P */
void BOARD_InitADC(void)
{
    /* Enables clock for switch matrix.: enable */
    CLOCK_EnableClock(kCLOCK_Swm);

    /* ADC_CHN6 connect to P0_20 */
    SWM_SetFixedPinSelect(SWM0, kSWM_ADC_CHN6, true);

    /* ADC_CHN7 connect to P0_19 */
    SWM_SetFixedPinSelect(SWM0, kSWM_ADC_CHN7, true);

    /* ADC_CHN8 connect to P0_18 */
    SWM_SetFixedPinSelect(SWM0, kSWM_ADC_CHN8, true);

    /* ADC_CHN9 connect to P0_17 */
    SWM_SetFixedPinSelect(SWM0, kSWM_ADC_CHN9, true);

    /* Disable clock for switch matrix. */
    CLOCK_DisableClock(kCLOCK_Swm);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitACOMP:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '49', peripheral: ACMP, signal: ACMP_IN3, pin_signal: PIO0_14/ACMP_I3/ADC_2}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitACOMP
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M0P */
void BOARD_InitACOMP(void)
{
    /* Enables clock for switch matrix.: enable */
    CLOCK_EnableClock(kCLOCK_Swm);

    /* ACMP_INPUT3 connect to P0_14 */
    SWM_SetFixedPinSelect(SWM0, kSWM_ACMP_INPUT3, true);

    /* Disable clock for switch matrix. */
    CLOCK_DisableClock(kCLOCK_Swm);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
